<?php
/**
* @comment ว 19/4 พฤศจิกายน 2548 (การโอนผู้สอบแข่งขันได้หรือผู้ได้รับคัดเลือก)
* @projectCode 57CMSS12
* @tor  -
* @package core
* @author Kiatisak Chansawang
* @access private
* @created 02/04/2015
*/
class changesalarydate extends utility{
	public function __construct(){
		$this->debug = "off";
	}
	
	public function checkExp(){
		return true;
	}
	
	 public function showExp(){
		echo '<div style="border:1px solid #006600; border-style:dashed; background-color:#aecde4;padding:5px;text-align: left;"><font color="#000000">';
		echo "<font color=\"#6A3500\"><b>ข้อเสนอแนะ :</b>ตรวจสอบวันที่ได้รับเงินเดือน และ/หรือปรับปรุงการกำหนดตำแหน่ง เลื่อนและแต่งตั้งให้ดำรงตำแหน่ง กรณีที่ได้รับคุณวุฒิเพิ่มขึ้น กับวันที่สถานศึกษารับรองให้สำเร็จการศึกษา โดยวันที่ได้รับเงินเดือน และ/หรือปรับปรุงการกำหนดตำแหน่ง เลื่อนและแต่งตั้งให้ดำรงตำแหน่ง จะต้องไม่น้อยกว่าวันที่สถานศึกษารับรองให้สำเร็จการศึกษา และผ่านการพิจารณาอนุมัติจากผู้มีอำนาจอย่างสมบูรณ์แล้ว
กรณีได้รับอนุญาตให้ลาศึกษาต่อ หรือฝึกอบรมตามระเบียบข้าราชการ  ให้ตรวจสอบวันที่ได้รับเงินเดือน  และ/หรือปรับปรุงการกำหนดตำแหน่ง เลื่อนและแต่งตั้งให้ดำรงตำแหน่ง กับวันที่ที่มีคำสั่งให้กลับเข้าปฎิบัติราชการ และวันที่ได้รับคุณวุฒิเพิ่ม โดยจะต้องไม่น้อยกว่าวันที่มีคำสั่งให้กลับเข้าปฏิบัติราชการและไม่น้อยกว่าวันที่ได้รับคุณวุฒิเพิ่มขึ้น</font>";
		echo '</div>';
  	}
	
}
?>