<?php
/**
* @comment ตรวจสอบการขอเลื่อน/มีวิทยฐานะตำแหน่งศึกษานิเทศก์
* @projectCode 57CMSS10
* @tor  -
* @package core
* @author Supachai
* @access private
* @created 15/1/2558
*/

class checkVitayaSupervision extends checkVitayaTeacher{
	public $vitaya = array(
		'1'=>array(
				'v_name'=>'ชำนาญการ',
				'v_caption'=>'ดำรงตำแหน่งศึกษานิเทศก์ มาแล้วไม่น้อยกว่า 2 ปี หรือดำรงตำแหน่งอื่นที่ ก.ค.ศ. เทียบเท่ามาแล้วไม่น้อยกว่า 2 ปี นับถึงวันที่ยื่นคำร้อง'		
			),
		'2'=>array(
				'v_name'=>'ชำนาญการพิเศษ',
				'v_caption'=>'ดำรงตำแหน่งศึกษานิเทศก์ ที่มีวิทยฐานะศึกษานิเทศก์ชำนาญการ มาแล้วไม่น้อยกว่า 1 ปี หรือดำรงตำแหน่งอื่นที่ ก.ค.ศ. เทียบเท่ามาแล้วไม่น้อยกว่า 1 ปี นับถึงวันที่ยื่นคำร้อง'		
			),
		'3'=>array(
				'v_name'=>'เชี่ยวชาญ',
				'v_caption'=>'ดำรงตำแหน่งศึกษานิเทศก์ ที่มีวิทยฐานะศึกษานิเทศก์ชำนาญการพิเศษ มาแล้วไม่น้อยกว่า 3 ปี หรือดำรงตำแหน่งศึกษานิเทศก์ ที่มีวิทยฐานะศึกษานิเทศก์ชำนาญการ มาแล้วไม่น้อยกว่า 5 ปี หรือดำรงตำแหน่งอื่นที่ ก.ค.ศ. เทียบเท่ามาแล้วไม่น้อยกว่า 3 ปี นับถึงวันที่ยื่นคำร้อง'		
			),
		'4'=>array(
				'v_name'=>'เชี่ยวชาญพิเศษ',
				'v_caption'=>'ดำรงตำแหน่งศึกษานิเทศก์ ที่มีวิทยฐานะศึกษานิเทศก์เชียวชาญ มาแล้วไม่น้อยกว่า 2 ปี หรือดำรงตำแหน่งอื่นที่ ก.ค.ศ. เทียบเท่ามาแล้วไม่น้อยกว่า 2 ปี นับถึงวันที่ยื่นคำร้อง'		
			),
		'5'=>array(
				'v_name'=>'',
				'v_caption'=>'ดำรงตำแหน่งครูมาแล้วไม่น้อยกว่า 4 ปี สำหรับผู้ที่มีวุฒิปริญญาตรี 2 ปี สำหรับผู้ที่มีวุฒิปริญญาโท นับถึงวันที่ยื่นคำร้อง'		
			)			
	);
	
	public function checkVitaya1(){	
		$this->pos_date = $this->view_general['comeday_c'];
		$this->date_period = $this->getPeriodReal($this->view_general['comeday_c'], $this->effective_date);
		return ($this->date_period[0] >= 2) ? true : false;	
	}
}
?>