<?php
/**
* @comment ตรวจสอบการขอเลื่อน/มีวิทยฐานะตำแหน่งรองผู้อำนวยการสถานศึกษา 
* @projectCode 57CMSS10
* @tor  -
* @package core
* @author Supachai
* @access private
* @created 15/1/2558
*/

class chrckVitayaSchoolDeputyDirector extends checkVitayaSupervision{
	public $vitaya = array(
		'1'=>array(
				'v_name'=>'ชำนาญการ',
				'v_caption'=>'ดำรงตำแหน่งรองผู้อำนวยการสถานศึกษา มาแล้วไม่น้อยกว่า 2 ปี หรือดำรงตำแหน่งอื่นที่ ก.ค.ศ. เทียบเท่ามาแล้วไม่น้อยกว่า 2 ปี นับถึงวันที่ยื่นคำร้อง'		
			),
		'2'=>array(
				'v_name'=>'ชำนาญการพิเศษ',
				'v_caption'=>'ดำรงตำแหน่งรองผู้อำนวยการสถานศึกษาที่มีวิทยฐานะรองผู้อำนวยการสถานศึกษาชำนาญการ มาแล้วไม่น้อยกว่า 1 ปี หรือดำรงตำแหน่งอื่นที่ ก.ค.ศ. เทียบเท่ามาแล้วไม่น้อยกว่า 1 ปี นับถึงวันที่ยื่นคำร้อง'		
			),
		'3'=>array(
				'v_name'=>'เชี่ยวชาญ',
				'v_caption'=>'ดำรงตำแหน่งรองผู้อำนวยการสถานศึกษาที่มีวิทยฐานะรองผู้อำนวยการสถานศึกษาชำนาญการพิเศษ มาแล้วไม่น้อยกว่า 3 ปี หรือดำรงตำแหน่งรองผู้อำนวยการสถานศึกษาที่มีวิทยฐานะรองผู้อำนวยการสถานศึกษาชำนาญการ มาแล้วไม่น้อยกว่า 5 ปี หรือดำรงตำแหน่งอื่นที่ ก.ค.ศ. เทียบเท่ามาแล้วไม่น้อยกว่า 3 ปี นับถึงวันที่ยื่นคำร้อง'		
			),
		'5'=>array(
				'v_name'=>'',
				'v_caption'=>'ดำรงตำแหน่งครูมาแล้วไม่น้อยกว่า 4 ปี สำหรับผู้ที่มีวุฒิปริญญาตรี 2 ปี สำหรับผู้ที่มีวุฒิปริญญาโท นับถึงวันที่ยื่นคำร้อง'		
			)
	);
}
?>