<?php
/**
* @comment class คำแนะนำตามกฎหมายมาตรา 53
* @projectCode 57CMSS10
* @tor  -
* @package core
* @author Pinya
* @access private
* @created 29/09/2014
*/

class Command_Acting1 extends utility{
	
	public function __construct(){
		$this->debug = "off";
	}
		
	public function checkExp(){
		return true;
	}
	public function showExp(){
		
		echo '<div style="border:1px solid #006600; border-style:dashed; background-color:#aecde4;padding:5px;text-align: left;"><font color="#000000">';
		echo "<font color=\"#6A3500\"><b>ข้อเสนอแนะ :</b>มาตรา ๕๓ ในกรณีที่ไม่มีผู้ดำรงตำแหน่งผู้อำนวยการสำนักงานเขตพื้นที่การศึกษา หรือมีแต่ไม่อาจปฏิบัติราชการได้ ให้รองผู้อำนวยการสำนักงานเขตพื้นที่การศึกษารักษาราชการแทน ถ้ามีรองผู้อำนวยการสำนักงานเขตพื้นที่การศึกษาหลายคน ให้เลขาธิการคณะกรรมการการศึกษาขั้นพื้นฐานแต่งตั้งรองผู้อำนวยการสำนักงานเขตพื้นที่การศึกษาคนใดคนหนึ่งรักษาราชการแทน ถ้าไม่มีผู้ดำรงตำแหน่งรองผู้อำนวยการสำนักงานเขตพื้นที่การศึกษา หรือมีแต่ไม่อาจปฏิบัติราชการได้ ให้เลขาธิการคณะกรรมการการศึกษาขั้นพื้นฐานแต่งตั้งข้าราชการในเขตพื้นที่การศึกษาซึ่งดำรงตำแหน่งเทียบเท่ารองผู้อำนวยการสำนักงานเขตพื้นที่การศึกษาหรือดำรงตำแหน่งไม่ต่ำกว่าผู้อำนวยการสถานศึกษาหรือตำแหน่งเทียบเท่าขึ้นไปคนใดคนหนึ่งเป็นผู้รักษาราชการแทนก็ได้ </font>";
		echo '</div>';
			
	}
	
}

?>