<?php
/**
* @comment class ตรวจสอบคำสั่ง
* @projectCode 57CMSS10
* @tor  -
* @package core
* @author Maiphrom
* @access private
* @created 02/04/2015
*/

class law109 extends utility{
	
	public function __construct(){
		$this->debug = "off";
	}
		
	public function checkExp(){
		return true;
	}
	public function showExp(){
		
		echo '<div style="border:1px solid #006600; border-style:dashed; background-color:#aecde4;padding:5px;text-align: left;"><font color="#000000">';
		echo "<font color=\"#6A3500\"><b>ข้อเสนอแนะ :</b>มาตรา ๑๐๙ ภายใต้บังคับตามมาตรา ๑๑๙ เมื่อข้าราชการครูและบุคลากรทางการ ศึกษาผู้ใดถูกสั่งเพิกถอนใบอนุญาตประกอบวิชาชีพ และไม่มีกรณีเป็นผู้ถูกสั่งให้ออกจาก ราชการตามมาตราอื่นตามพระราชบัญญัตินี้ ถ้าภายในสามสิบวันนับแต่วันที่หน่วยงาน การศึกษาของผู้ถูกสั่งเพิกถอนใบอนุญาตประกอบวิชาชีพปฏิบัติงานอยู่ได้รับหนังสือแจ้งการเพิก ถอนใบอนุญาตประกอบวิชาชีพมีตำแหน่งว่างหรือตำแหน่งอื่นที่ไม่ต้องมีใบอนุญาตประกอบ วิชาชีพ และผู้บังคับบัญชาหน่วยงานการศึกษานั้นพิจารณาเห็นว่าผู้นั้นมีความเหมาะสมที่จะ บรรจุและแต่งตั้งให้ดำรงตำแหน่งดังกล่าว และไม่เป็นผู้ขาดคุณสมบัติตามมาตรา ๓๐ และ มาตรา ๔๒ ให้ผู้บังคับบัญชาซึ่งเป็นผู้บริหารหน่วยงานการศึกษานั้น ส่งเรื่องให้ อ.ก.ค.ศ. เขต พื้นที่การศึกษา หรือ ก.ค.ศ. แล้วแต่กรณี เพื่อพิจารณาอนุมัติ และให้นำมาตรา ๕๗ วรรคหนึ่ง มาใช้บังคับโดยอนุโลม 
 ในกรณีที่หน่วยงานการศึกษาตามวรรคหนึ่งไม่มีตำแหน่งว่างหรือตำแหน่งที่สามารถย้าย ไปแต่งตั้งให้ดำรงตำแหน่งได้ และผู้บังคับบัญชาหน่วยงานการศึกษาตามวรรคหนึ่งพิจารณาเห็น ว่า ผู้นั้นมีความเหมาะสมที่จะได้รับการบรรจุและแต่งตั้งให้ดำรงตำแหน่งอื่นที่ไม่ต้องมี ใบอนุญาตประกอบวิชาชีพในหน่วยงานการศึกษาอื่น ถ้าภายในสามสิบวันนับแต่วันที่ส่วน ราชการหรือสำนักงานเขตพื้นที่การศึกษาได้รับเรื่องจากหน่วยงานการศึกษาตามวรรคหนึ่ง มี หน่วยงานการศึกษาอื่นที่มีตำแหน่งว่าง หรือตำแหน่งที่สามารถย้ายไปแต่งตั้งให้ดำรงตำแหน่งได้ และ อ.ก.ค.ศ. เขตพื้นที่การศึกษาหรือ ก.ค.ศ. แล้วแต่กรณี พิจารณาเห็นว่าผู้นั้นมีความ เหมาะสมที่จะได้รับการแต่งตั้งให้ดำรงตำแหน่งดังกล่าว ให้นำมาตรา ๕๙ มาใช้บังคับโดย อนุโลม
  ภายในกำหนดเวลาสามสิบวันตามวรรคหนึ่งและวรรคสอง ถ้าหน่วยงานการศึกษาใดไม่ มีตำแหน่งว่างหรือตำแหน่งที่สามารถย้ายไปแต่งตั้งให้ดำรงตำแหน่งได้ หรือ อ.ก.ค.ศ. เขตพื้นที่ การศึกษา หรือ ก.ค.ศ. แล้วแต่กรณีไม่อนุมัติ ให้ผู้มีอำนาจตามมาตรา ๕๓ สั่งให้ผู้นั้นออกจาก ราชการโดยพลัน ทั้งนี้ ตามระเบียบว่าด้วยการออกจากราชการตามที่ ก.ค.ศ. กำหนด ราชการโดยพลัน ทั้งนี้ ตามระเบียบว่าด้วยการออกจากราชการตามที่ ก.ค.ศ. กำหนด</font>";
		echo '</div>';
			
	}
}

?>