<?php
/**
* @comment class ตรวจสอบกฎหมายมาตรา 38
* @projectCode 57CMSS10
* @tor  -
* @package core
* @author Eakkasit Kamwong
* @access private
* @created 02/04/2014
*/

class law38 extends utility{
	
	public function __construct(){
		$this->debug = "off";
	}
		
	public function checkExp(){
		return true;
	}
	public function showExp(){
		
		echo '<div style="border:1px solid #006600; border-style:dashed; background-color:#aecde4;padding:5px;text-align: left;"><font color="#000000">';
		echo "<font color=\"#6A3500\"><b>ข้อเสนอแนะ :</b>มาตรา ๓๘ ตำแหน่งข้าราชการครูและบุคลากรทางการศึกษามี ๓ ประเภทดังนี้<br>
														ก. ตำแหน่งซึ่งมีหน้าที่เป็นผู้สอนในหน่วยงานการศึกษา ได้แก่ ตำแหน่งดังต่อไปนี้<br>
														(๑) ครูผู้ช่วย<br>
														(๒) ครู<br>
														๒๑<br>
														(๓) อาจารย์<br>
														(๔) ผู้ช่วยศาสตราจารย์<br>
														(๕) รองศาสตราจารย์<br>
														(๖) ศาสตราจารย์<br>
														ตำแหน่งใน (๑) และ (๒) จะมีในหน่วยงานการศึกษาใดก็ได้ ส่วนตำแหน่งใน (๓) ถึง (๖) ให้มีในหน่วยงานการศึกษาที่สอนระดับปริญญา<br>
														ข.[๑๐] ตำแหน่งผู้บริหารสถานศึกษาและผู้บริหารการศึกษา ได้แก่ ตำแหน่งดังต่อไปนี้<br>
														(๑) รองผู้อำนวยการสถานศึกษา<br>
														(๒) ผู้อำนวยการสถานศึกษา<br>
														(๓) รองผู้อำนวยการสานักงานเขตพื้นที่การศึกษา<br>
														(๔) ผู้อำนวยการสานักงานเขตพื้นที่การศึกษา<br>
														(๕) ตำแหน่งที่เรียกชื่ออย่างอื่นตามที่ ก.ค.ศ. กำหนด<br>
														ตำแหน่งผู้บริหารใน (๑) และ (๒) ให้มีในสถานศึกษาและหน่วยงานการศึกษาตามประกาศกระทรวง ตำแหน่งผู้บริหารใน (๓) และ (๔) ให้มีในสานักงานเขตพื้นที่การศึกษา
														ตำแหน่งผู้บริหารในหน่วยงานการศึกษาที่สอนระดับปริญญา การกำหนดระดับตำแหน่ง การให้ได้รับเงินเดือนและเงินประจาตำแหน่ง ให้นากฎหมายว่าด้วยระเบียบข้าราชการพลเรือนในสถาบันอุดมศึกษามาใช้บังคับโดยอนุโลม เว้นแต่ ก.ค.ศ. จะกำหนดไว้เป็นอย่างอื่น
														ค. ตำแหน่งบุคลากรทางการศึกษาอื่น มีดังต่อไปนี้<br>
														(๑) ศึกษานิเทศก์<br>
														(๒) ตำแหน่งที่เรียกชื่ออย่างอื่นตามที่ ก.ค.ศ. กำหนด หรือตำแหน่งของข้าราชการที่ ก.ค.ศ. นำมาใช้กำหนดให้เป็นตำแหน่งข้าราชการครูและบุคลากรทางการศึกษาตามพระราชบัญญัตินี้
														การกำหนดระดับตำแหน่ง และการให้ได้รับเงินเดือนและเงินประจาตำแหน่งของตำแหน่งบุคลากรทางการศึกษาอื่นตาม ค. (๒) ให้เป็นไปตามที่กำหนดในกฎ ก.ค.ศ. โดยให้นำกฎหมายว่าด้วยระเบียบข้าราชการพลเรือนในส่วนที่เกี่ยวข้องกับการกำหนดตำแหน่ง และการให้ได้รับเงินเดือนและเงินประจำตำแหน่งของข้าราชการพลเรือนสามัญมาใช้บังคับโดยอนุโลม
														</font>";
		echo '</div>';
			
	}
}

?>