<?php
/**
* @comment class ตรวจสอบกฎหมายมาตรา 57
* @projectCode 57CMSS10
* @tor  -
* @package core
* @author Eakkasit Kamwong
* @access private
* @created 02/04/2014
*/

class law58 extends utility{
	
	public function __construct(){
		$this->debug = "off";
	}
		
	public function checkExp(){
		return true;
	}
	public function showExp(){
		
		echo '<div style="border:1px solid #006600; border-style:dashed; background-color:#aecde4;padding:5px;text-align: left;"><font color="#000000">';
		echo "<font color=\"#6A3500\"><b>ข้อเสนอแนะ :</b>มาตรา ๕๘ การโอนพนักงานส่วนท้องถิ่นตามกฎหมายว่าด้วยระเบียบบริหารงานบุคคลส่วนท้องถิ่นที่มิใช่พนักงานวิสามัญ และการโอนข้าราชการอื่นที่มิใช่ข้าราชการครูและบุคลากรทางการศึกษาตามพระราชบัญญัตินี้ และมิใช่ข้าราชการการเมือง มาบรรจุและแต่งตั้งเป็นข้าราชการครูและบุคลากรทางการศึกษา อาจทำได้หากบุคคลนั้นสมัครใจ โดยให้ผู้มีอำนาจตามมาตรา ๕๓ ของหน่วยงานการศึกษาที่ประสงค์จะรับโอนทำความตกลงกับผู้มีอำนาจสั่งบรรจุของส่วนราชการหรือหน่วยงานสังกัดเดิม แล้วเสนอเรื่องให้ ก.ค.ศ. หรือ อ.ก.ค.ศ. เขตพื้นที่การศึกษา แล้วแต่กรณี อนุมัติโดยให้คำนึงถึงประโยชน์ที่หน่วยงานการศึกษานั้นจะได้รับเป็นสำคัญ ทั้งนี้ จะบรรจุและแต่งตั้งให้มีตำแหน่งใด วิทยฐานะใดและให้ได้รับเงินเดือนเท่าใด ให้
เป็นไปตามที่ ก.ค.ศ. กำหนด แต่เงินเดือนที่จะให้ได้รับต้องไม่สูงกว่าข้าราชการครูและบุคลากรทางการศึกษาที่มีคุณวุฒิ ความสามารถ ความชำนาญ หรือความเชี่ยวชาญในระดับเดียวกัน เว้นแต่จะเป็นการโอนตามวรรคสอง</font>";
		echo '</div>';
			
	}
	
}

?>