<?php
/**
* @comment class ตรวจสอบคำสั่ง
* @projectCode 57CMSS10
* @tor  -
* @package core
* @author Maiphrom
* @access private
* @created 02/04/2015
*/

class law59 extends utility{
	
	public function __construct(){
		$this->debug = "off";
	}
		
	public function checkExp(){
		return true;
	}
	public function showExp(){
		
		echo '<div style="border:1px solid #006600; border-style:dashed; background-color:#aecde4;padding:5px;text-align: left;"><font color="#000000">';
		echo "<font color=\"#6A3500\"><b>ข้อเสนอแนะ :</b>มาตรา 59 การย้ายข้าราชการครูและบุคลากรทางการศึกษาผู้ใดไปดารงตำแหน่งในหน่วยงานการศึกษาอื่นภายในส่วนราชการหรือภายในเขตพื้นที่การศึกษาหรือต่างเขตพื้นที่การศึกษาต้องได้รับอนุมัติจาก อ.ก.ค.ศ. เขตพื้นที่การศึกษา หรือ อ.ก.ค.ศ. ที่ ก.ค.ศ. ตั้ง ของผู้ประสงค์ย้ายและผู้รับย้าย แล้วแต่กรณี และให้สถานศึกษาโดยคณะกรรมการสถานศึกษาเสนอความเห็นประกอบการพิจารณาของ อ.ก.ค.ศ. เขตพื้นที่การศึกษา หรือ อ.ก.ค.ศ. ที่ ก.ค.ศ. ตั้ง ด้วย และเมื่อ อ.ก.ค.ศ. เขตพื้นที่การศึกษา หรือ อ.ก.ค.ศ. ที่ ก.ค.ศ. ตั้ง พิจารณาอนุมัติแล้ว ให้ผู้มีอำนาจตามมาตรา 59 สั่งบรรจุและแต่งตั้งผู้นั้นต่อไป
การย้ายผู้อำนวยการสำนักงานเขตพื้นที่การศึกษาและรองผู้อำนวยการสำนักงานเขตพื้นที่การศึกษาให้เลขาธิการคณะกรรมการการศึกษาขั้นพื้นฐานเป็นผู้สั่งย้ายโดยอนุมัติ ก.ค.ศ.
  การย้ายข้าราชการพลเรือนสามัญเพื่อไปบรรจุและแต่งตั้งให้ดำรงตำแหน่งเป็นข้าราชการครูและบุคลากรทางการศึกษาต้องได้รับอนุมัติจาก ก.ค.ศ. แต่ถ้าเป็นการย้ายไปบรรจุและแต่งตั้งในตำแหน่งซึ่ง ก.ค.ศ. ยังมิได้กำหนดจะกระทำได้เมื่อ ก.ค.ศ. กำหนดตำแหน่งแล้ว
 หลักเกณฑ์และวิธีการย้ายตามวรรคหนึ่งและวรรคสองให้เป็นไปตามที่ ก.ค.ศ. กำหนด</font>";
		echo '</div>';
			
	}
	
}

?>