<?php
/**
* @comment class ตรวจสอบคำสั่ง
* @projectCode 57CMSS10
* @tor  -
* @package core
* @author Pinya
* @access private
* @created 16/03/2015
*/

class Quit_Government38k4 extends utility{
	
	public function __construct(){
		$this->debug = "off";
	}
		
	public function checkExp(){
		return true;
	}
	public function showExp(){
		
		echo '<div style="border:1px solid #006600; border-style:dashed; background-color:#aecde4;padding:5px;text-align: left;"><font color="#000000">';
								echo "<font color=\"#6A3500\"><b>ข้อเสนอแนะ :</b>ผู้มีอำนาจตามมาตรา ๕๓ มีอำนาจสั่งให้ข้าราชการครูและบุคลากรทางการศึกษาออกจากราชการเพื่อรับบำเหน็จบำนาญตามกฎหมายว่าด้วยบำเหน็จบำนาญ ๕๗ ข้าราชการได้ในกรณีที่กฎหมายดังกล่าวบัญญัติให้ผู้ถูกสั่งให้ออกมีสิทธิได้รับบำเหน็จบำนาญ แต่
						ในการสั่งให้ออกจากราชการเพื่อรับบำเหน็จบำนาญเหตุรับราชการนานจะต้องมีกรณีตามที่
						กำหนดในกฎ ก.ค.ศ. ด้วย และการสั่งให้ออกจากราชการเพื่อรับบำเหน็จบำนาญเหตุทดแทน
						นอกจากทำได้ในกรณีที่บัญญัติไว้ในมาตราอื่นตามพระราชบัญญัตินี้และกรณีที่กฎหมายว่าด้วย
						บำเหน็จบำนาญข้าราชการบัญญัติให้ผู้ถูกสั่งให้ออกมีสิทธิได้รับบำเหน็จบำนาญเหตุทดแทนแล้ว
						ให้ทำได้ในกรณีต่อไปนี้ด้วย คือ
						(๑) เมื่อข้าราชการครูและบุคลากรทางการศึกษาผู้ใดเจ็บปุวยไม่อาจปฏิบัติหน้าที่
						ราชการของตนได้โดยสม่ำเสมอ ถ้าผู้มีอำนาจดังกล่าวเห็นสมควรให้ออกจากราชการแล้ว ให้สั่ง
						ให้ผู้นั้นออกจากราชการได้
						(๒) เมื่อข้าราชการครูและบุคลากรทางการศึกษาผู้ใดสมัครไปปฏิบัติงานใดๆ ตามความ
						ประสงค์ของทางราชการ ให้ผู้มีอำนาจดังกล่าวสั่งให้ผู้นั้นออกจากราชการ
						(๓) เมื่อข้าราชการครูและบุคลากรทางการศึกษาผู้ใดขาดคุณสมบัติตามมาตรา ๓๐ (๑)
						(๔) (๕) (๗) (๘) หรือ (๙) ให้ผู้มีอำนาจดังกล่าวสั่งให้ผู้นั้นออกจากราชการ
						(๔) เมื่อข้าราชการครูและบุคลากรทางการศึกษาผู้ใดมีกรณีถูกกล่าวหาหรือมีเหตุอัน
						ควรสงสัยว่าเป็นผู้ขาดคุณสมบัติทั่วไปตามมาตรา ๓๐ (๓) และผู้มีอำนาจตามมาตรา ๕๓ เห็น
						ว่ากรณีมีมูลก็ให้ผู้มีอำนาจดังกล่าวสั่งแต่งตั้งคณะกรรมการสอบสวนโดยไม่ชักช้า และนำมาตรา ๑๑๑ มาใช้บังคับโดยอนุโลม ในกรณีที่ ก.ค.ศ. หรือ อ.ก.ค.ศ. เขตพื้นที่การศึกษามีมติว่าผู้นั้นเป็นผู้ขาดคุณสมบัติทั่วไปตามมาตรา ๓๐ (๓) ก็ให้ผู้มีอำนาจดังกล่าวสั่งให้ผู้นั้นออกจากราชการ
						(๕) เมื่อทางราชการเลิกหรือยุบตำแหน่งใด ให้ผู้มีอำนาจตามมาตรา ๕๓ สั่งให้
						ข้าราชการครูและบุคลากรทางการศึกษาผู้ดำรงตำแหน่งนั้นออกจากราชการได้ตามหลักเกณฑ์
						และวิธีการที่ ก.ค.ศ. ก าหนด
						(๖) เมื่อข้าราชการครูและบุคลากรทางการศึกษาผู้ใดไม่สามารถปฏิบัติราชการให้มี
						ประสิทธิภาพเกิดประสิทธิผลในระดับอันเป็นที่พอใจของทางราชการได้ ให้ผู้มีอำนาจตาม
						มาตรา ๕๓ สั่งให้ผู้นั้นออกจากราชการ ทั้งนี้ ตามหลักเกณฑ์และวิธีการที่ก าหนดในกฎ ก.ค.ศ.</font>";
		echo '</div>';
			
	}
	
}

?>