<?php
/**
* @comment class ตรวจสอบคำสั่ง
* @projectCode 57CMSS10
* @tor  -
* @package core
* @author Pinya
* @access private
* @created 16/03/2015
*/

class Quit_Government38k6 extends utility{
	
	public function __construct(){
		$this->debug = "off";
	}
		
	public function checkExp(){
		return true;
	}
	public function showExp(){
		
		echo '<div style="border:1px solid #006600; border-style:dashed; background-color:#aecde4;padding:5px;text-align: left;"><font color="#000000">';
		echo "<font color=\"#6A3500\"><b>ข้อเสนอแนะ :</b>ข้าราชการครูและบุคลากรทางการศึกษาออกจากราชการเมื่อ
														<br/>(๑) ตาย
														<br/>(๒) พ้นจากราชการตามกฎหมายว่าด้วยบำเหน็จบำนาญข้าราชการ
														<br/>(๓) ลาออกจากราชการและได้รับอนุญาตให้ลาออกหรือการลาออกมีผลตามมาตรา
														๑๐๘
														<br/>(๔) ถูกสั่งให้ออกตามมาตรา ๔๙ มาตรา ๕๖ วรรคสอง วรรคสาม หรือวรรคห้า มาตรา
														๑๐๓ มาตรา ๑๑๐ มาตรา ๑๑๑ มาตรา ๑๑๒ มาตรา ๑๑๓ มาตรา ๑๑๔ หรือมาตรา ๑๑๘
														๕๕
														<br/>(๕) ถูกสั่งลงโทษปลดออกหรือไล่ออก
														<br/>(๖) ถูกเพิกถอนใบอนุญาตประกอบวิชาชีพ เว้นแต่ได้รับแต่งตั้งให้ดำรงตำแหน่งอื่นที่ไม่
														<br/>ต้องมีใบอนุญาตประกอบวิชาชีพตามมาตรา ๑๐๙
														<br/>วันออกจากราชการตาม (๔) (๕) และ (๖) ให้เป็นไปตามระเบียบที่ ก.ค.ศ. วางไว้
														<br/>การต่อเวลาราชการให้ข้าราชการครูและบุคลากรทางการศึกษาที่ต้องออกจากราชการตาม (๒)
														<br/>รับราชการต่อไป จะกระทำมิได้</font>";
		echo '</div>';
			
	}
	
}

?>