<?php
/**
* @comment class ข้อเสนอแนะของกฎหมายมาตรา 67
* @projectCode 57CMSS10
* @tor  -
* @package core
* @author Pinya
* @access private
* @created 29/09/2014
*/

class RecruitmentAndAppointment1 extends utility{
	
	public function __construct(){
		$this->debug = "off";
	}
		
	public function checkExp(){
		return true;
	}
	public function showExp(){
		
		echo '<div style="border:1px solid #006600; border-style:dashed; background-color:#aecde4;padding:5px;text-align: left;"><font color="#000000">';
		echo "<font color=\"#6A3500\"><b>ข้อเสนอแนะ :</b>พนักงานส่วนท้องถิ่นตามกฎหมายว่าด้วยระเบียบบริหารงานบุคคลสวนท้องถิ่น ที่ไม่ใช่พนักงานวิสามัญ หรือไม่ใช่ข้าราชการหรือพนักงานซึ่งออกจากงานในระหว่างทดลองปฏิบัติงาน หรือข้าราชการที่ไม่ใช่ข้าราชการครูและบุคลากรทางการศึกษาและไม่ใช่ข้าราชการการเมือง ข้าราชการวิสามัญ หรือข้าราชการซึ่งออกจากราชการในระหว่างทดลองปฏิบัติหน้าที่ราชการ ผู้ใดออกจากงาน หรือออกจากราชการไปแล้ว ถ้าสมัครเข้ารับราชการเป็นข้าราชการครและบ ู ุคลากรทางการศึกษาและทางราชการประสงค์รับผู้นั้นเข้ารับราชการ ให้ผู้มีอํานาจตามมาตรา ๕๓ ที่ประสงค์จะรับเขาร้ ับราชการเสนอเรื่องไปให้ ก.ค.ศ. หรือผู้ที่ ก.ค.ศ. มอบหมาย พิจารณาอนุมัติในการนี้ให้ก.ค.ศ. หรือผู้ที่ ก.ค.ศ. มอบหมาย พิจารณาโดยคํานึงถึงประโยชน์ที่ทางราชการจะได้รับ ทั้งนี้ จะบรรจุและแต่งตั้งเข้ารับราชการเป็นข้าราชการครูและบุคลากรทางการศึกษาโดยให้มี ตําแหน่งใด วิทยฐานะใด และจะได้รับเงินเดือนเท่าใด ให้ก.ค.ศ. เป็นผู้พิจารณากําหนด แต่จะต้องไม่สูงกว่าข้าราชการครูและบุคลากรทางการศึกษาที่มีคุณวุฒิความสามารถและความชํานาญ หรือความเชี่ยวชาญในระดับเดียวกันเพื่อประโยชน์ในการนับเวลาราชการ ให้ถือเวลาราชการหรือเวลาทํางานของผู้เข้ารับราชการตามวรรคหนึ่ง ในขณะที่เป็นพนักงานส่วนท้องถิ่นตามกฎหมายว่าด้วยระเบียบบริหารงานบุคคลส่วนท้องถิ่นหรือในขณะที่เป็นข้าราชการตามกฎหมายเกี่ยวกับการบริหารงานบุคคลของข้าราชการนั้นเป็นเวลาราชการของข้าราชการครและบุคลากรทางการศึกษาตามพระราชบัญญัตินี้ด้วย  </font>";
		echo '</div>';
			
	}
	
}

?>